SigninLogs
| where UserAgent contains "python-requests"
| where UserId == "<user_id>" 
| summarize ObjectIds = make_set(UserId), UserAgents = make_set(UserAgent) by IPAddress
| project IPAddress, ObjectIds, UserAgents
